ChangXiaodong/MSP430-CC1125/msp_exp430g2/hal_msp_exp430g2_spi.c
/**************************************************************************/
//  @file       file name
//
//  @brief      describtion
//
//  Copyright (C) 2013 Texas Instruments Incorporated - http://www.ti.com/
//
//
//  Redistribution and use in source and binary forms, with or without
//  modification, are permitted provided that the following conditions
//  are met:
//
//    Redistributions of source code must retain the above copyright
//    notice, this list of conditions and the following disclaimer.
//
//    Redistributions in binary form must reproduce the above copyright
//    notice, this list of conditions and the following disclaimer in the
//    documentation and/or other materials provided with the distribution.
//
//    Neither the name of Texas Instruments Incorporated nor the names of
//    its contributors may be used to endorse or promote products derived
//    from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//****************************************************************************/


/*****************************************************************************
* INCLUDES
*/
#include "msp430.h"
#include "hal_msp_exp430g2_spi.h"
#include "hal_types.h"

/******************************************************************************
* LOCAL VARIABLES
*/


/******************************************************************************
* STATIC FUNCTIONS
*/
static void trxReadWriteBurstSingle(uint8 addr,uint8 *pData,uint16 len) ;

/******************************************************************************
 * @fn          function name
 *
 * @brief       Description of the function
 *                
 * @param       input, output parameters
 *
 * @return      describe return value, if any
*/
void exp430RfSpiInit(void)
{
  UCB0CTL1 |= UCSWRST;
  SPI_PORT_SEL |= SPI_MOSI_PIN + SPI_MISO_PIN + SPI_SCLK;                            
  SPI_PORT_SEL &= ~CS_N_PIN;
  SPI_PORT_OUT |= SPI_MISO_PIN + CS_N_PIN;
  SPI_PORT_DIR |= CS_N_PIN;
  SPI_PORT_DIR |= SPI_MOSI_PIN + SPI_SCLK;
  SPI_PORT_DIR &= ~SPI_MISO_PIN;
  UCB0CTL0  = 0x00 + UCMST + UCSYNC + UCMSB + UCCKPH;       
  UCB0CTL1 |=  UCSSEL_3;
  UCB0BR0 = 0x01;
  UCB0BR1 = 0x00;
  UCB0CTL1 &= ~UCSWRST;
  return;
}
/******************************************************************************
 * @fn          function name
 *
 * @brief       Description of the function
 *                
 * @param       input, output parameters
 *
 * @return      describe return value, if any
*/
  uint8 readValue;
uint8 trx8BitRegAccess(uint8 accessType, uint8 addrByte, uint8 *pData, uint16 len)
{


  //Pull CS_N low and wait for SO to go low before communication starts
  SPI_BEGIN();
  //while(SPI_PORT_IN & SPI_MISO_PIN);
  // send register address byte
  SPI_TX(accessType|addrByte);
  SPI_WAIT_DONE();
  // Storing chip status
  readValue = SPI_RX();
  
  trxReadWriteBurstSingle(accessType|addrByte,pData,len);
  SPI_END();
  // return the status byte value */
  return(readValue);
}
/******************************************************************************
 * @fn          trx16BitRegAccess
 *
 * @brief       This function performs a read or write in the extended adress
 *              space of CC112X.
 *
 * input parameters
 *
 * @param       accessType - Specifies if this is a read or write and if it's
 *                           a single or burst access. Bitmask made up of
 *                           RADIO_BURST_ACCESS/RADIO_SINGLE_ACCESS/
 *                           RADIO_WRITE_ACCESS/RADIO_READ_ACCESS.
 * @param       extAddr - Extended register space address = 0x2F.
 * @param       regAddr - Register address in the extended address space.
 * @param       *pData  - Pointer to data array for communication
 * @param       len     - Length of bytes to be read/written from/to radio
 *
 * output parameters
 *
 * @return      rfStatus_t
 */
rfStatus_t trx16BitRegAccess(uint8 accessType, uint8 extAddr, uint8 regAddr, uint8 *pData, uint8 len)
{
  uint8 readValue;

  SPI_BEGIN();
  //while(SPI_PORT_IN & SPI_MISO_PIN);
  /* send extended address byte with access type bits set */
  SPI_TX(accessType|extAddr);
  SPI_WAIT_DONE();
  /* Storing chip status */
  readValue = SPI_RX();
  SPI_TX(regAddr);
  SPI_WAIT_DONE();
  /* Communicate len number of bytes */
  trxReadWriteBurstSingle(accessType|extAddr,pData,len);
  SPI_END();
  /* return the status byte value */
  return(readValue);
}
/*******************************************************************************
 * @fn          trxSpiCmdStrobe
 *
 * @brief       Send command strobe to the radio. Returns status byte read
 *              during transfer of command strobe. Validation of provided
 *              is not done. Function assumes chip is ready.
 *
 * input parameters
 *
 * @param       cmd - command strobe
 *
 * output parameters
 *
 * @return      status byte
 */
uint8 a,b;
rfStatus_t trxSpiCmdStrobe(uint8 cmd)
{
    uint8 rc;
    SPI_BEGIN();
    //while(SPI_PORT_IN & SPI_MISO_PIN);
    SPI_TX(cmd);
    SPI_WAIT_DONE();
    rc = SPI_RX();
    SPI_END();
    return(rc);
}
/*******************************************************************************
 * @fn          trxReadWriteBurstSingle
 *
 * @brief       When the address byte is sent to the SPI slave, the next byte
 *              communicated is the data to be written or read. The address
 *              byte that holds information about read/write -and single/
 *              burst-access is provided to this function.
 *
 *              Depending on these two bits this function will write len bytes to
 *              the radio in burst mode or read len bytes from the radio in burst
 *              mode if the burst bit is set. If the burst bit is not set, only
 *              one data byte is communicated.
 *
 *              NOTE: This function is used in the following way:
 *
 *              SPI_BEGIN();
 *              while(TRXEM_PORT_IN & SPI_MISO_PIN);
 *              ...[Depending on type of register access]
 *              trxReadWriteBurstSingle(uint8 addr,uint8 *pData,uint16 len);
 *              SPI_END();
 *
 * input parameters
 *
 * @param       none
 *
 * output parameters
 *
 * @return      void
 */
static void trxReadWriteBurstSingle(uint8 addr,uint8 *pData,uint16 len)
{
	uint16 i;
	/* Communicate len number of bytes: if RX - the procedure sends 0x00 to push bytes from slave*/
  if(addr&RADIO_READ_ACCESS)
  {
    if(addr&RADIO_BURST_ACCESS)
    {
      for (i = 0; i < len; i++)
      {
          SPI_TX(0);            /* Possible to combining read and write as one access type */
          SPI_WAIT_DONE();
          *pData = SPI_RX();     /* Store pData from last pData RX */
          pData++;
      }
    }
    else
    {
      SPI_TX(0);
      SPI_WAIT_DONE();
      *pData = SPI_RX();
    }
  }
  else
  {
    if(addr&RADIO_BURST_ACCESS)
    {
      /* Communicate len number of bytes: if TX - the procedure doesn't overwrite pData */
      for (i = 0; i < len; i++)
      {
        SPI_TX(*pData);
        SPI_WAIT_DONE();
        pData++;
      }
    }
    else
    {
      SPI_TX(*pData);
      SPI_WAIT_DONE();
    }
  }
  return;
}
/******************************************************************************
 * @fn          function name
 *
 * @brief       Description of the function
 *                
 * @param       input, output parameters
 *
 * @return      describe return value, if any
 ******************************************************************************/

/***********************************************************************************
  Copyright 2011 Texas Instruments Incorporated. All rights reserved.

  IMPORTANT: Your use of this Software is limited to those specific rights
  granted under the terms of a software license agreement between the user
  who downloaded the software, his/her employer (which must be your employer)
  and Texas Instruments Incorporated (the "License").  You may not use this
  Software unless you agree to abide by the terms of the License. The License
  limits your use, and you acknowledge, that the Software may not be modified,
  copied or distributed unless embedded on a Texas Instruments microcontroller
  or used solely and exclusively in conjunction with a Texas Instruments radio
  frequency transceiver, which is integrated into your product.  Other than for
  the foregoing purpose, you may not use, reproduce, copy, prepare derivative
  works of, modify, distribute, perform, display or sell this Software and/or
  its documentation for any purpose.

  YOU FURTHER ACKNOWLEDGE AND AGREE THAT THE SOFTWARE AND DOCUMENTATION ARE
  PROVIDED “AS IS?WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED,
  INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF MERCHANTABILITY, TITLE,
  NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT SHALL
  TEXAS INSTRUMENTS OR ITS LICENSORS BE LIABLE OR OBLIGATED UNDER CONTRACT,
  NEGLIGENCE, STRICT LIABILITY, CONTRIBUTION, BREACH OF WARRANTY, OR OTHER
  LEGAL EQUITABLE THEORY ANY DIRECT OR INDIRECT DAMAGES OR EXPENSES
  INCLUDING BUT NOT LIMITED TO ANY INCIDENTAL, SPECIAL, INDIRECT, PUNITIVE
  OR CONSEQUENTIAL DAMAGES, LOST PROFITS OR LOST DATA, COST OF PROCUREMENT
  OF SUBSTITUTE GOODS, TECHNOLOGY, SERVICES, OR ANY CLAIMS BY THIRD PARTIES
  (INCLUDING BUT NOT LIMITED TO ANY DEFENSE THEREOF), OR OTHER SIMILAR COSTS.

  Should you have any questions regarding your right to use this Software,
  contact Texas Instruments Incorporated at www.TI.com.
***********************************************************************************/